; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=162, out_folder=./training, instance_id=14, seed=2038, goal_proportion=0.03

(define (problem blocksworld-14)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 - object)
 (:init 
    (arm-empty)
    (clear b99)
    (on b99 b149)
    (on b149 b42)
    (on-table b42)
    (clear b63)
    (on b63 b7)
    (on b7 b41)
    (on b41 b87)
    (on b87 b24)
    (on b24 b50)
    (on-table b50)
    (clear b27)
    (on b27 b114)
    (on b114 b64)
    (on b64 b40)
    (on b40 b117)
    (on b117 b20)
    (on-table b20)
    (clear b38)
    (on-table b38)
    (clear b142)
    (on b142 b162)
    (on b162 b81)
    (on b81 b52)
    (on b52 b106)
    (on b106 b159)
    (on-table b159)
    (clear b66)
    (on-table b66)
    (clear b158)
    (on b158 b151)
    (on-table b151)
    (clear b88)
    (on-table b88)
    (clear b73)
    (on b73 b32)
    (on-table b32)
    (clear b16)
    (on-table b16)
    (clear b95)
    (on-table b95)
    (clear b86)
    (on-table b86)
    (clear b120)
    (on b120 b55)
    (on-table b55)
    (clear b21)
    (on b21 b29)
    (on b29 b130)
    (on b130 b103)
    (on b103 b53)
    (on b53 b70)
    (on b70 b30)
    (on b30 b51)
    (on b51 b123)
    (on b123 b127)
    (on b127 b111)
    (on b111 b77)
    (on b77 b141)
    (on-table b141)
    (clear b80)
    (on b80 b36)
    (on b36 b82)
    (on b82 b10)
    (on b10 b108)
    (on-table b108)
    (clear b44)
    (on b44 b100)
    (on b100 b109)
    (on-table b109)
    (clear b11)
    (on b11 b46)
    (on b46 b138)
    (on-table b138)
    (clear b132)
    (on b132 b126)
    (on b126 b84)
    (on b84 b145)
    (on b145 b153)
    (on b153 b92)
    (on b92 b61)
    (on-table b61)
    (clear b94)
    (on b94 b68)
    (on b68 b148)
    (on b148 b116)
    (on b116 b119)
    (on b119 b37)
    (on b37 b110)
    (on b110 b33)
    (on b33 b34)
    (on b34 b134)
    (on b134 b17)
    (on b17 b69)
    (on b69 b12)
    (on b12 b62)
    (on-table b62)
    (clear b136)
    (on b136 b115)
    (on b115 b65)
    (on b65 b129)
    (on b129 b58)
    (on b58 b125)
    (on b125 b144)
    (on-table b144)
    (clear b121)
    (on b121 b18)
    (on-table b18)
    (clear b107)
    (on b107 b25)
    (on b25 b2)
    (on-table b2)
    (clear b113)
    (on b113 b104)
    (on-table b104)
    (clear b45)
    (on-table b45)
    (clear b71)
    (on b71 b150)
    (on b150 b67)
    (on b67 b74)
    (on-table b74)
    (clear b59)
    (on b59 b1)
    (on-table b1)
    (clear b39)
    (on-table b39)
    (clear b140)
    (on-table b140)
    (clear b79)
    (on b79 b76)
    (on b76 b154)
    (on b154 b72)
    (on b72 b105)
    (on b105 b49)
    (on b49 b135)
    (on-table b135)
    (clear b6)
    (on b6 b156)
    (on b156 b93)
    (on-table b93)
    (clear b146)
    (on b146 b54)
    (on-table b54)
    (clear b48)
    (on b48 b97)
    (on-table b97)
    (clear b133)
    (on-table b133)
    (clear b98)
    (on b98 b56)
    (on b56 b91)
    (on-table b91)
    (clear b60)
    (on b60 b9)
    (on b9 b13)
    (on b13 b101)
    (on b101 b5)
    (on b5 b102)
    (on-table b102)
    (clear b14)
    (on b14 b47)
    (on-table b47)
    (clear b161)
    (on b161 b31)
    (on-table b31)
    (clear b124)
    (on b124 b75)
    (on b75 b152)
    (on b152 b35)
    (on b35 b90)
    (on-table b90)
    (clear b147)
    (on b147 b22)
    (on-table b22)
    (clear b139)
    (on-table b139)
    (clear b160)
    (on b160 b96)
    (on-table b96)
    (clear b85)
    (on b85 b118)
    (on-table b118)
    (clear b157)
    (on-table b157)
    (clear b128)
    (on b128 b8)
    (on b8 b3)
    (on-table b3)
    (clear b131)
    (on b131 b112)
    (on b112 b83)
    (on-table b83)
    (clear b26)
    (on b26 b78)
    (on-table b78)
    (clear b15)
    (on b15 b89)
    (on-table b89)
    (clear b43)
    (on b43 b57)
    (on-table b57)
    (clear b4)
    (on-table b4)
    (clear b155)
    (on b155 b143)
    (on-table b143)
    (clear b137)
    (on b137 b28)
    (on b28 b19)
    (on b19 b122)
    (on b122 b23)
    (on-table b23))
 (:goal  (and 
    (clear b3)
    (on b3 b4)
    (on b4 b2)
    (on b2 b1)
    (on-table b1))))

; plan
1. (unstack b107 b25)
   deleted: (on b107 b25) (clear b107) (arm-empty)
   added: (holding b107) (clear b25)
   goals met: 1 of 5
2. (putdown b107)
   deleted: (holding b107)
   added: (clear b107) (arm-empty) (on-table b107)
   goals met: 1 of 5
3. (unstack b128 b8)
   deleted: (on b128 b8) (clear b128) (arm-empty)
   added: (holding b128) (clear b8)
   goals met: 1 of 5
4. (putdown b128)
   deleted: (holding b128)
   added: (clear b128) (arm-empty) (on-table b128)
   goals met: 1 of 5
5. (unstack b25 b2)
   deleted: (on b25 b2) (clear b25) (arm-empty)
   added: (holding b25) (clear b2)
   goals met: 1 of 5
6. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 1 of 5
7. (unstack b59 b1)
   deleted: (on b59 b1) (clear b59) (arm-empty)
   added: (holding b59) (clear b1)
   goals met: 1 of 5
8. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 1 of 5
9. (unstack b8 b3)
   deleted: (on b8 b3) (clear b8) (arm-empty)
   added: (holding b8) (clear b3)
   goals met: 2 of 5
10. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 5
11. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 2 of 5
12. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 3 of 5
13. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 3 of 5
14. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 4 of 5
15. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 3 of 5
16. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 5 of 5
